# UnableToMaintainExclusions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToMaintainExclusions Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to maintain exclusion of some group members. Some excluded members have been restored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToMaintainExclusions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToMaintainExclusions As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToMaintainExclusions {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace